In [ ]:
import sqlite3 as sq

# Create a Database

In [ ]:
# databse = sq.connect("database_name")
databse = sq.connect("test.db")
print ("Databse Successfull Created!")

Databse Successfull Created!

# Perform the Queries

In [ ]:
'''Create Table table_name (
    Name char (100),
    Age int
);'''

# databse.execute()

# Create a Table

In [ ]:
databse.execute('''
Create Table table_name (
    Name char (100),
    Age int
);
''')

print ("Table Created")

Table Created

In [ ]:
databse.execute("INSERT INTO Table_name Values ('TONY', 25);")
databse.execute("INSERT INTO Table_name Values ('THOR', 35);")
databse.execute("INSERT INTO Table_name Values ('SPIDER', 45);")

print ("Data has been inserted")

Data has been inserted

In [ ]:
data= databse.execute("SELECT * FROM Table_name;")

In [ ]:
for i in data:
  print (i)

('TONY', 25)
('THOR', 35)
('SPIDER', 45)